; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	thermograph1 - mode
	thermograph0 - mode
	GroundStation0 - direction
	Star6 - direction
	GroundStation1 - direction
	GroundStation10 - direction
	Star4 - direction
	GroundStation7 - direction
	Star3 - direction
	Star9 - direction
	GroundStation2 - direction
	Star8 - direction
	GroundStation5 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon15)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation10)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon15)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star6)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument7 thermograph0)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 Star4)
	(supports instrument8 thermograph1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 Star8)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
	(supports instrument10 thermograph1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation2)
	(calibration_target instrument10 GroundStation7)
	(supports instrument11 thermograph0)
	(supports instrument11 thermograph1)
	(calibration_target instrument11 GroundStation10)
	(calibration_target instrument11 Star3)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 thermograph0)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 Star4)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation10)
	(supports instrument13 thermograph0)
	(calibration_target instrument13 Star3)
	(calibration_target instrument13 GroundStation7)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 Star8)
	(calibration_target instrument14 GroundStation2)
	(calibration_target instrument14 Star9)
	(supports instrument15 thermograph0)
	(calibration_target instrument15 GroundStation5)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star14)
)
(:goal (and
	(pointing satellite1 Star3)
	(pointing satellite2 Phenomenon15)
	(pointing satellite5 Star6)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 thermograph0)
	(have_image Planet13 thermograph1)
	(have_image Star14 thermograph0)
	(have_image Phenomenon15 thermograph1)
))

)

; plan
1. (switch_on instrument11 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument11)
   goals met: 1 of 8
2. (calibrate satellite5 instrument11 groundstation10)
   added: (calibrated instrument11)
   goals met: 1 of 8
3. (turn_to satellite5 phenomenon15 groundstation10)
   deleted: (pointing satellite5 groundstation10)
   added: (pointing satellite5 phenomenon15)
   goals met: 1 of 8
4. (take_image satellite5 phenomenon15 instrument11 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 2 of 8
5. (turn_to satellite5 phenomenon12 phenomenon15)
   deleted: (pointing satellite5 phenomenon15)
   added: (pointing satellite5 phenomenon12)
   goals met: 2 of 8
6. (take_image satellite5 phenomenon12 instrument11 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 3 of 8
7. (turn_to satellite5 phenomenon11 phenomenon12)
   deleted: (pointing satellite5 phenomenon12)
   added: (pointing satellite5 phenomenon11)
   goals met: 3 of 8
8. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   goals met: 4 of 8
9. (take_image satellite5 phenomenon11 instrument11 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 5 of 8
10. (turn_to satellite5 planet13 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 planet13)
   goals met: 5 of 8
11. (take_image satellite5 planet13 instrument11 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 6 of 8
12. (turn_to satellite5 star14 planet13)
   deleted: (pointing satellite5 planet13)
   added: (pointing satellite5 star14)
   goals met: 6 of 8
13. (take_image satellite5 star14 instrument11 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 7 of 8
14. (turn_to satellite5 star6 star14)
   deleted: (pointing satellite5 star14)
   added: (pointing satellite5 star6)
   goals met: 8 of 8
